[{
  "key": 1,
  "title": "3 Delicious Tofu Recipes That You Should Try On Sunday",
  "name": "Sweet Chili Tofu",
  "ingredients": [
    "Cornstarch",
    "Salt",
    "Pepper",
    "Olive Oil",
    "Bell pepper (Red/green)",
    "Onion",
    "Sweet Chili Sauce (From supermarkets)"
  ],
  "methods": "Add cornstarch, salt, and paper in a bowl. Then coat the tofu in it. Get ready with your preheated pan and fry them with olive oil for about five minutes until they are slightly brown. And keep them on the side. On the same pan add pepper and onion and dry fry them for about 2-4 mins until it gets soft. Add tofu to the pan. Cook it for another two minutes. Then get a serving bowl and pour sweet chili sauce to it.",
  "detail": "http://EzineArticles.com/9911054"
},{
  "key": 2,
  "title": "3 Delicious Tofu Recipes That You Should Try On Sunday",
  "name": "Tofu Lettuce wrap",
  "ingredients": [
    "Water Chestnuts (drained and diced)",
    "Edamame",
    "Spring Onion",
    "Minced Garlic and Onion Paste",
    "Soya Sauce",
    "Lettuce"    
  ],
  "methods": "Throw everything in a hot pan cook them until the tofu starts to look like golden brown. Make sure to keep the heat over medium. Add a dash of soya sauce to the pan (in the last minute). Now fill the lettuce with cooked tofu.",
  "detail": "http://EzineArticles.com/9911054"
},{
  "key": 3,
  "title": "3 Top Vegetable Recipes For Slow Cooker",
  "name": "Best Ever Crock Pot Mashed Potatoes",
  "ingredients": [
    "2 1/4 kilograms red potatoes, sliced into chunks",
    "3 cubes chicken bouillon",
    "1 cup sour cream",
    "1 cup cream cheese, softened",
    "1/2 cup butter",
    "1 tablespoon minced garlic",
    "Salt and pepper to taste"
  ],
  "methods": "Fill a large pot with lightly salted water and boil potatoes with chicken bouillon and garlic until potatoes are tender but still firm. Drain potatoes in a bowl, reserving water. Mash potatoes with sour cream and cream cheese, spooning reserved water to achieve desired consistency. Transfer mashed potatoes to a slow cooker, cover and cook for 2 to 3 hours on low. Stir in butter, salt and pepper before serving.",
  "detail": "http://EzineArticles.com/9765534"
},{
  "key": 4,
  "title": "Delicious High-Protein Breakfast Recipes for Vegetarians",
  "name": "Green Chile and Cheese Frittata",
  "ingredients": [
    "10 eggs, beaten",
    "2 cups low fat cottage cheese",
    "1 cup shredded Cheddar cheese",
    "1 cup diced green chile peppers",
    "1/2 cup all-purpose flour",
    "1/4 cup melted butter",
    "1 teaspoon baking powder",
    "1 pinch salt"
  ],
  "methods": "Stir together eggs, all-purpose flour, baking powder and salt in a large bowl. Add cottage cheese, Cheddar cheese, chile peppers and melted butter to the bowl. Pour mixture into a lightly-greased 9x13-inch baking dish then bake in a pre-heated oven (400F) for 15 minutes. Lower heat to 325F then continue baking for 30 minutes more. Cool then slice into small squares.",
  "detail": "http://EzineArticles.com/9722682"
},{
  "key": 5,
  "title": "Delicious High-Protein Breakfast Recipes for Vegetarians",
  "name": "Black Bean Breakfast Burrito",
  "ingredients": [
    "8 10-inch flour tortillas, heated",
    "8 eggs, beaten",
    "2 cups black beans",
    "2 cups salsa",
    "1 1/2 cups shredded Cheddar cheese",
    "2 tablespoons vegetable oil"
  ],
  "methods": "Cook black beans over medium-low heat in a saucepan until heated through. Heat the vegetable oil in a large skillet then scramble the eggs together to desired doneness. Lay a tortilla flat on a clean surface then spoon black beans on it, followed by scrambled eggs, salsa and cheese. Roll into burritos. Do this for remaining ingredients.",
  "detail": "http://EzineArticles.com/9722682"
},{
  "key": 6,
  "title": "Must-Try Vegetarian Recipes for Healthy Snacking",
  "name": "All-Veggie Delicious Nachos",
  "ingredients": [
    "1 bag tortilla chips",
    "1 green bell pepper, chopped",
    "1 onion, chopped",
    "3 3/4 cups refried beans",
    "1 cup shredded lettuce",
    "1 cup jalapeno salsa",
    "1 cup shredded pepper jack cheese",
    "1/2 cup sliced black olives"
  ],
  "methods": "In a saucepan over medium heat, stir refried beans and salsa together for 5 minutes or until well-blended and heated through. Line a rimmed baking sheet with heavy duty aluminum foild then arrange tortilla chips on the sheet. Pour refried beans mixture over tortillas then top with green bell pepper, onion and cheese. Bake on a re-heated oven broiler for 3-5 minutes or until cheese has melted. Garnish with lettuce and olives before serving.",
  "detail": "http://EzineArticles.com/9722439"
},{
  "key": 7,
  "title": "3 Healthy and Guilt-Free Side Dishes for Your Next Barbecue",
  "name": "Baked Lemon Garlic Broccoli",
  "ingredients": [
    "2 heads broccoli, separated into florets",
    "1 clove garlic, minced",
    "2 teaspoons extra-virgin olive oil",
    "1 teaspoon sea salt",
    "1/2 teaspoon lemon juice",
    "1/2 teaspoon ground black pepper"
  ],
  "methods": "Toss the broccoli florets with minced garlic, extra-virgin olive oil, sea salt and ground black pepper in a bowl. Arrange florets evenly on a baking sheet and bake in a pre-heated oven (400 degrees F) for 15 to 20 minutes or until tender enough to be pierced with a fork. Pour lemon juice over broccoli before serving.",
  "detail": "http://EzineArticles.com/9670890"
},{
  "key": 8,
  "title": "3 Kale Salad Recipes Healthy Eaters Will Enjoy",
  "name": "Kale de la Creme",
  "ingredients": [
    "4 cups chopped kale",
    "1 lemon, zested and juiced",
    "1/2 cup Greek-style plain yogurt",
    "1/4 cup mayonnaise",
    "1/4 cup chopped red onion",
    "3 tablespoons sunflower seeds",
    "3 tablespoons raisins",
    "2 teaspoons sugar"
  ],
  "methods": "In a large bowl, combine kale, onion and raisins.In a separate bowl, whisk together lemon zest, lemon juice, yogurt, mayonnaise and sugar. Pour dressing into the bowl of kale and toss to coat. Refrigerate for 2 hours. When ready, sprinkle with sunflower seeds, toss and serve.",
  "detail": "http://EzineArticles.com/9561377"
},{
  "key": 9,
  "title": "3 Grilled Vegetable Recipes That Will Make You Go Green",
  "name": "Cilantro Grilled Tofu",
  "ingredients": [
    "1 3/4 cup firm tofu cubes",
    "2 cloves garlic, minced",
    "1/4 cup lime juice",
    "5 tablespoons chopped fresh cilantro",
    "1 tablespoon olive oil",
    "2 teaspoons chili powder",
    "1/4 teaspoon cayenne pepper",
    "Salt and ground black pepper to taste",
    "Skewers"
  ],
  "methods": "Thread tofu cubes onto skewers then set aside. In a medium bowl, mix together garlic, lime juice, cilantro, olive oil, chili powder, cayenne pepper, salt and black pepper. Stir until ingredients are well-combined. Brush skewered tofu with the mixture thoroughly then place on a plate. Cover with plastic wrap then refrigerate for 2 hours to overnight. Place remaining marinade in a jar and refrigerate. When ready, cook tofu on a pre-heated grill over medium heat, brushing occasionally with marinade, for 10-15 minutes or when blackened spots appear.",
  "detail": "http://EzineArticles.com/9250915"
},{
  "key": 10,
  "title": "3 Grilled Vegetable Recipes That Will Make You Go Green",
  "name": "Grilled Butter and Cheese Zucchini",
  "ingredients": [
    "1 large zucchini, thinly sliced",
    "1 clove garlic, minced",
    "1/2 cup shredded Parmesan cheese",
    "3 tablespoons butter, melted",
    "Cooking spray"
  ],
  "methods": "Use cooking spray to lightly oil a 9x12-inch foil pan. Arrange zucchini slices in the pan then set aside. Mix garlic and butter in a small bowl then brush zucchini generously with the mixture. Top with Parmesan cheese. Cook zucchini in a pre-heated grill over medium-high heat for 12-15 minutes or until zucchini is tender and cheese has melted.",
  "detail": "http://EzineArticles.com/9250915"
},{
  "key": 11,
  "title": "Tasty Vegan Caribbean Puddings",
  "name": "Yellow Yam Pudding",
  "ingredients": [
    "8 oz or 225 g yellow yam (grated raw)",
    "6oz or 175 g brown sugar",
    "2 tbsp burnt sugar or molasses",
    "7 oz or 200 g fruits (soaked)",
    "4oz or 110 g vegan butter or margarine",
    "1/2 tsp vanilla extract (can also use vanilla essence)"
  ],
  "methods": "Beat grated yam with a fork until light. Combine all ingredients and mix briskly. Steam in a pudding steamer.",
  "detail": "http://EzineArticles.com/8039653"
},{
  "key": 12,
  "title": "Raw Kale Recipes - 3 Easy Recipes!",
  "name": "Tropical Smoothie",
  "ingredients": [
    "1 cup pineapple",
    "1 cup mango",
    "1 banana",
    "6 Lacinto or Dinosaur Kale leaves",
    "2 cups water"
  ],
  "methods": "Blend all ingredients in a powerful blender such as the Vitamix until completely smooth and creamy. Add honey, agave nectar, stevia or another sweetener if desired. Enjoy as a super healthy addition to your breakfast routine or as nutritious snack during the day.",
  "detail": "http://EzineArticles.com/7117163"
},{
  "key": 13,
  "title": "Raw Kale Recipes - 3 Easy Recipes!",
  "name": "Green Juice",
  "ingredients": [
    "5 ribs celery",
    "1 large English cucumber",
    "2-3 large Fuji apples",
    "1/2 lime",
    "6 Curly Kale leaves"
  ],
  "methods": "Put all the ingredients through a juicer. My favorite juicer because of it's versatility is the Omega Vert 350. If you don't have a juicer an alternative would be to chop the cucumber, apple, and celery and place it in a blender (cucumber first) with the chopped kale and peeled lime. Blend on high for about thirty seconds and then pour and squeeze the mixture through a sprout bag over a big bowl. Sprout bags are relatively inexpensive and have a variety of uses. The sprout bag will strain out all the pulp and leave you with a smooth and silky juice. Pour the juice back into the blender carafe and then pour into a glass.",
  "detail": "http://EzineArticles.com/7117163"
},{
  "key": 14,
  "title": "Simple Chickpea Recipe",
  "name": "Chickpea Salad",
  "ingredients": [
    "4 cups cooked, drained and rinsed chickpeas",
    "1/2 cup diced red pepper",
    "1/2 cup diced green pepper",
    "1/2 cup sliced black olives (drained and rinsed)",
    "1/2 cup diced red onion",
    "1/4 cup chopped parsley",
    "1/4 cup shredded carrots",
    "3 tbsp each extra virgin olive oil and lemon juice",
    "3 pinches kosher salt",
    "4 pinches pepper",
    "4 pinches of dry mint"
  ],
  "methods": "Combine all vegetables and parsley in a large bowl and toss. Add olive oil and lemon juice mix. Add salt, pepper, and mint. Toss all ingredients and until mixed thoroughly. You may serve as a side dish or as the first course.",
  "detail": "http://EzineArticles.com/6470952"
},{
  "key": 15,
  "title": "A Delicious and Healthy Pizza Recipe in 7 Easy Steps",
  "name": "Pizza Spectrum",
  "ingredients": [
    "pizza crust tofu (cubed or diced into tiny bits)",
    "butter or oil",
    "mushrooms",
    "pineapple tidbits",
    "cucumber",
    "tomato sauce",
    "green bell pepper",
    "Edam cheese",
    "mozzarella"
  ],
  "methods": "Pre-heat your oven at 375 F (190 C) for 20 minutes. Lay your pizza crust in a baking pan. Spread the tomato sauce evenly on top of the crust. You can actually use any kind of brands of tomato sauce but I prefer Del Monte's Gourmet selection since it has already that distinctive classic taste that you don't need to add anything because the sauce is complete in itself. Then add the grated cheese. For this particular recipe I used Edam cheese since that's what we have available. Though it's perfect since it's a bit salty so it became also a substitute for salt. Meanwhile, fry the tofu in butter or oil. I prefer the tofu almost grounded for it's more crunchy and will appear and taste like unsalted chicharon. But if you don't like crunchy you can just slice it into cubes and don't over fry it so this way it will taste and feel like meat. Then sprinkle it on top of the crust. Next add the remaining ingredients: cucumber, mushrooms, pineapple, and bell pepper and manage to decorate the pizza as well while adding them. Then sprinkle the grated mozzarella on top. Bake for 10 to 15 minutes or until crust is brown. Then serve with hot sauce or ketchup.",
  "detail": "http://EzineArticles.com/6397455"
},{
  "key": 16,
  "title": "Tomato and Roasted Red Pepper Rice",
  "name": "Tomato and Roasted Red Pepper Rice",
  "ingredients": [
    "1 cup tomato pulp",
    "2 tbsp. vegetable oil",
    "200g of roasted red peppers (the jarred stuff is fine to use for this recipe)",
    "4-5 shallots, finely chopped",
    "7-8 curry leaves",
    "2 tbsp. Channa dhal (Bengal gram)",
    "10-15 cashew nuts halved",
    "2 red chillies and 1 green chilli (or to taste)",
    "300g uncooked rice",
    "The spices; ½ tsp. garam masala, ½ tsp. mustard seeds, 1 tsp. cumin seeds, pinch of asafoetida, salt to taste"
  ],
  "methods": "Wash and boil the rice and then keep it to the side. Whilst the rice is cooking, whizz (roughly) together the tomatoes and the roasted red peppers to a deep red pulp. Heat the oil in a deep pan, then add the asafoetida, cumin seeds, mustard seeds, chillies, Bengal gram and curry leaves and cook until the gram is golden brown and crunchy. Stir in the cashew nuts and stir until they've browned a little. Bring it together with the onions, add the salt and sauté for a couple of minutes before bringing in the garlic and sauté until they have softened. Add the tomatoes and red pepper and bring It to a gentle simmer before stirring in the garam masala and then stir in the cooked rice. Serve with something yogurt and garnish with coriander.",
  "detail": "http://EzineArticles.com/6394788"
},{
  "key": 17,
  "title": "Indian Superfood Recipes",
  "name": "Easy Pomegranate Shrikhand",
  "ingredients": [
    "100g of pomegranate seeds (about one medium sized pomegranate)",
    "500g of quark cheese",
    "Caster sugar to taste",
    "1/4 tsp of cardamom powder",
    "A small pinch of saffron (approximately 4-5 strands)",
    "2 tsp of rose water",
    "12-15 roughly chopped pistachios"
  ],
  "methods": "In a mixing bowl, smooth together the quark cheese and caster sugar. Include enough sugar to your taste for a dessert. Combine the quark cheese and sugar mixture with the cardamom powder, rose water and chopped pistachios. Squash the strands of saffron into the side of the bowl, then beat them in. The light orange colour will infuse into the shrikhand. Mix in half of the pomegranate seeds, leaving the other half for decoration and then serve.",
  "detail": "http://EzineArticles.com/6394818"
},{
  "key": 18,
  "title": "Indian Superfood Recipes",
  "name": "Easy Blueberry Shrikhand",
  "ingredients": [
    "150g of blueberries",
    "500g of quark cheese",
    "Approximately 6 tbsp of caster sugar",
    "1/4 tsp of cardamom powder",
    "15 roughly chopped pistachios"
  ],
  "methods": "In a mixing bowl, blend 100g of the blueberries to a smooth consistency, leaving no pulp. Then combine it with 4 tbsp of caster sugar. Simmer the mixture on medium flame for 3-4 minutes, stirring continuously. Turn off the heat and then allow the blueberry sauce to cool completely. Mix together the quark cheese and blueberry sauce until it turns a beautiful lavender colour. Add 2 tbsp of caster sugar (you can moderate this depending on your taste for a dessert). Stir in the cardamom powder and the most of the pistachios, leaving some for decoration. Serve, using the remaining blueberries (whole) for decoration or mix them in with the shrikhand. Sprinkle the individual portions lightly with the remaining chopped pistachios.",
  "detail": "http://EzineArticles.com/6394818"
},{
  "key": 19,
  "title": "How To Prepare Banana Heart For A Perfect Veggie Burger",
  "name": "Banana Heart Burger",
  "ingredients": [
    "2 lbs. prepared banana heart",
    "4 cloves garlic, minced",
    "1 bulb spring onion, chopped",
    "1 medium size carrots, finely chopped",
    "3 eggs",
    "1 tablespoon oyster sauce",
    "all-purpose flour",
    "Salt and pepper to taste"
  ],
  "methods": "Place all ingredients in a mixing bowl except flour and mix thoroughly. Add the flour a little at a time to achieve the desired consistency. Form the mixture into individual patties making sure that they have compressed, even thickness for even cooking. Place the patties on a well-oiled cast iron grill pan few inches apart and cook each side for 4-5 minutes on a medium to high heat until golden brown.",
  "detail": "http://EzineArticles.com/6222881"
},{
  "key": 20,
  "title": "30-Minute Vegetarian Curry Meal Recipe",
  "name": "Quick Vegetable Curry",
  "ingredients": [
    "2 cups uncooked basmati rice",
    "2 tablespoons olive oil",
    "1 large onion",
    "3 small zucchini",
    "2 cups sliced mushrooms",
    "1 cup cauliflower, broken into bite-size chunks",
    "up to 3 tablespoons mild curry powder",
    "1 teaspoon ginger",
    "1/2 cup hot water",
    "1 vegetable flavored bouillon cube",
    "salt to taste"
  ],
  "methods": "Prepare rice according to package directions. While rice is cooking, prepare curry. Coarsely chop onion. In large skillet with lid, begin sautéing onion in olive oil on medium high heat. When onion is translucent, add chicken if using, stirring frequently for another 3 minutes. While onion mixture is cooking, slice mushrooms and add. Coarsely chop zucchini and cauliflower and add to skillet. Continue sautéing another minute or two. Add remaining ingredients. Stir well. Cover and bring to boil. Once stew begins to boil, reduce heat and set lid slightly ajar. Continue simmering for another 15-20 minutes. While curry is simmering, prepare cucumber raita.",
  "detail": "http://EzineArticles.com/6145040"
},{
  "key": 21,
  "title": "3 Delicious Dishes That You Can Make From Okra",
  "name": "Fried Okra",
  "ingredients": [
    "1 lb okra",
    "salt",
    "water",
    "cornmeal",
    "salt and pepper",
    "lard, olive oil, or peanut oil"
  ],
  "methods": "Slice okra 1/4 thick. Salt heavily and cover with very cold water. Refrigerate one hour. Rinse and drain well. Roll in cornmeal seasoned with salt and pepper. Fry in deep skillet with 1/2 of fat till brown and crisp. Drain on paper towels. Enjoy.",
  "detail": "http://EzineArticles.com/5722902"
},{
  "key": 22,
  "title": "Healthy Banana Cake (Naturopath-Approved)",
  "name": "Banana Cake",
  "ingredients": [
    "1 cup bran",
    "1 cup milk (almond or other)",
    "1 cup wholemeal self-raising flour (or use half whole-wheat and half buckwheat to cut down on the gluten)",
    "2-4 ripe bananas (very ripe works best)",
    "1 cup chopped dried fruit and/or nuts: prunes, almonds, figs, rasins, sunflower seeds.",
    "You could also try fresh fruit like apples, pears, or berries, etc"
  ],
  "methods": "Heat oven to 180 C. Soak bran with milk for couple min, then add other ingredients. Mix well. Pour into greased baking/caking pan or tin loaf (works as a loaf or flat as a cake). Bake for 1-1.25 hours (until sharp knife comes out clean). You can experiment and mix together any combination of nuts, dried fruits and fresh fruits. We have put everything and anything in it that was in the kitchen. Even the pulp from our juicer made it in there once, but without much success:-) We wanted to try it, as it's always such a waste to throw out the rest of the fruit from the juicer.",
  "detail": "http://EzineArticles.com/5595438"
},{
  "key": 23,
  "title": "Avocado Recipe",
  "name": "Avocado Mousse",
  "ingredients": [
    "2 avocados",
    "1 small can tuna, packed in water, drained",
    "1 tablespoon mayonnaise",
    "4 tablespoons sour cream (low or fat free)",
    "2 tablespoons",
    "Dijon mustard",
    "juice from one lemon",
    "sea salt"
  ],
  "methods": "Cut avocados in two lengthwise. Remove pit; scoop out flesh and place in blender or food processor. Save skins. Add remaining ingredients, purée until smooth and creamy texture. Distribute mousse evenly into skin halves. Chill if not serving immediately. Can be made a few hours in advance.",
  "detail": "http://EzineArticles.com/5579814"
},{
  "key": 24,
  "title": "Healthy Kale Soup (Naturopath Approved)",
  "name": "Kale Soup",
  "ingredients": [
    "750g Kale (approx. 3-4 cups)",
    "350g potatoes (approx. 2 cups)",
    "1 onion",
    "3 carrots",
    "1 garlic",
    "50g butter",
    "125 ml cream (approx. 1/2 cup)",
    "1 litre broth (msg free)",
    "salt, pepper, nutmeg to taste"
  ],
  "methods": "Cut kale in stripes, wash, blanché in saltwater (cook quickly for 3min or so). Peel potatoes and carros and dice. Dice onion and garlic. Fry onion and garlic in butter. Add kale, carrots and potatoes and saute for a few minutes. Add broth and cook until soft. Puree it all and add cream. Season with nutmeg, salt, pepper.",
  "detail": "http://EzineArticles.com/5595465"
}]